tutorials/blastFoam/forwardStep/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1.40001;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.40001;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1.40001;
        value           uniform 1.40001;
    }

    bottom
    {
        type            symmetryPlane;
    }

    top
    {
        type            symmetryPlane;
    }

    obstacle
    {
        type            symmetryPlane;
    }

    obstacleB
    {
        type            symmetryPlane;
    }


    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
