tutorials/blastFoam/forwardStep/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      Kurganov;

ddtSchemes
{
    default         Euler;
    timeIntegrator  RK2SSP;
}

gradSchemes
{
    default        Gauss linear;
//  default        cellLimited Gauss linear 1.0; //when the mesh is irregular
}

divSchemes
{
    default         none;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
    reconstruct(rho)    ROUNDL;
    reconstruct(U)      ROUNDLV;
    reconstruct(e)      ROUNDL;
    reconstruct(p)      ROUNDL;
    reconstruct(speedOfSound) ROUNDL;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
