tutorials/blastFoam/forwardStep/Allrun
blastFoam > log.blastFoam


